{
  "resource": [
    "Siobhan awoke to the Irish sun spilling in the open doorframe of their single-room cottage. Her back pressed against Sean’s, and she moved carefully so as to not wake him on his day off morning duties— today, she would feed the cattle and chickens. She rolled over, a stray mattress feather poking her side, and saw Aoife’s small body in her basket, enveloped by a blanket. A surge in Siobhan’s chest shot her awake—Aoife hadn’t cried once through the night. Siobhan scrambled to her feet, bare soles pressed into the cool packed dirt, no longer minding waking Sean. Aoife was still breathing, gently, though not stirring from her slumber.",
    "The night before, Siobahn and Sean had broken many unforetold rules. They left their beautiful blond-haired, blue-eyed baby directly across an open door, ripe for the taking. The child was decorated with no red berries from rowan trees, nor garlands woven of daisies. Most egregious, they left no pail of buttermilk outside their front door on the Feast of the Assumption.",
    "Though she was breathing, something had to be wrong. Aoife usually had Siobhan up half the night. Was it too soon for her to be starving? The rhythm of Aoife’s tiny chest rising and falling didn’t convince Siobhan that she would actually wake up. So, Siobahn was about to break another rule—she would wake a sleeping baby.",
    "“Aoife, ‘re ye hungry?” She hooked her index finger and dragged it across the infant’s smooth forehead.",
    "Aoife hammered her wrinkled fists and wailed powerfully, unweakened by her empty stomach, to Siobhan’s relief. Sean woke to the supernaturally shrill cries, groaned, and pulled on his boots.",
    "“Sorry, dear,” Siobhan scooped the wriggling babe into her arms, “I’ve to feed Aoife, then I’ll go out.”",
    "“I’m already up,” Sean grumbled. He lit the hearth in the middle of the room and warmed his palms.",
    "“Fine. After she’s fed, I’ll get on the oatcakes.”",
    "Aoife refused to latch and continued screeching. She had fallen asleep somewhere else, where her name wasn’t Aoife. Held by her mother, snuggled into her skin, the color of honey, but slightly more transparent. This woman wasn’t her mother. Dressed in rags and a stained fichu, with strings of mousy hair tumbling out of a crushed bonnet. And she only had two eyes, neither of which were solid black and flecked with gold.",
    "Siobhan softly sang Too-Ra-Loo-Ra-Loo-Ral and petted Aoife’s peach-fuzz head. She stopped crying and looked around the room with wide, dark eyes. Darker than before, Siobhan would have sworn.",
    "“Sean,” Siobhan caught him in the doorway, “I’m worried about Aoife.”",
    "She continued to worry about Aoife, who grew into the most peculiar child.",
    "At two years, Aoife hadn’t started speaking. Siobhan would hold up and name a brooch, a comb, a spindle, prompting Aoife to parrot. But she wouldn’t. Maybe a gurgle or babble. Siobhan knew the girl could hear because she calmed at lullabies, and was unsettlingly attentive to the noises and space around her. Then, one day, Aoife looked up and asked, “May I please have a cup of milk, Mam?” And she spoke in no less than full sentences from that day forth.",
    "As she got older, she came to possess a strange knowledge that no child should have. However, it was often so strange that the adults around her couldn’t notice. Like how Aoife’s favorite chicken, Goldie, to whom she felt a special connection and shared all of her secrets, had the same birthday as her. When collecting stones by the river, she would always grab the oldest one—and when gathering eggs for breakfast, she’d pick the ones with the richest yolks.",
    "She disliked being touched and refused to hug her parents. She played alone, running around the farm collecting textured and striped rocks, or other little treasures like pinecones and the spiny burrs of horse chestnuts. She’d dump her collections on the floor—to Siobhan’s dismay, exasperated at having to step over the mess—and sort them into piles based on size, then shape, then color.",
    "“Aoife,” Siobhan said, stopping Aoife in her tracks, who was carrying around Goldie’s eggs in her frock like she could incubate and hatch them. “You either need to put on your coat or come inside.”",
    "“No.” The raw wool rubbed against Aoife’s skin like steel. She preferred the cool air pricking it numb.",
    "It was still too warm for Aoife to freeze. She was stubborn, but not an actual problem, Siobhan thought. The youngest needed to be fed, and she needed to darn the hole in Sean’s kirtle, and she needed to apply hemlock to her aching knees. Siobhan didn’t have the energy to argue with her defiant child.",
    "Siobhan largely stopped trying to correct Aoife’s behaviors and let her live off in her isolated dreamland, off away from them. It was easier than putting up with her. Siobhan only had to make sure she was eating and had a place to sleep. And though they didn’t know where she went during the day, what little adventures she’d go on, she was always back by supper.",
    "But then supper became an issue too.",
    "Alongside a hearty slice of brown bread, Siobhan ladled out the pottage, which had been brewing over its permanent home on the hearth, sprinkled with that day’s leftovers of stewing beef, pearl barley, and peas. However, the carrots got added too late in the day. Their texture was Wrong. The chunks grated against Aoife’s tongue like sandpaper, and she refused to eat it.",
    "Sean told Aoife that she was not allowed to get up until she finished.",
    "Siobahn and Sean finished their meals. The three littles, all still blonde, as their hair hadn’t turned brunette after the first cut like Aoife’s, lapped up their meals and fell asleep in a pile. Aoife stubbornly sat there all night. In a sliver of moonlight sneaking in the doorframe, to appease her protesting stomach, she meticulously picked out every piece of carrot, then sopped up the remaining pottage with bread.",
    "In the morning, Siobhan saw Aoife sleeping sat upright, slumped over a pile of soggy carrots arranged in a pyramid on the floor.",
    "“Aoife—” the girl nodded awake. “Ye didn’t finish, ingrate. What’s this, wastin’ food?” Siobhan pointed to the dirt-caked carrot chunks.",
    "“I’ll give it to Goldie.”",
    "“No. Yer stayin’ in today, ‘til ye learn to do what yer told.”",
    "Aoife, still on the floor, drew her legs up in on herself, hugged around her legs, and began rocking.",
    "“Knock it off, Aoife. Look at me.”",
    "The girl still silently stared off and continued rocking. She could hear everything all at once—gusts rustling the thatched roof—her father’s fingers impatiently tapping his crossed arms—giggles and whispers of the littles gathered ‘round, astonished at their mother’s volume and stern tone.",
    "“AOIFE.”",
    "Siobhan’s yell shot straight through Aoife’s ears and lodged itself like an icepick in her brain. Aoife screamed at the top of her lungs. That inhuman, supernaturally shrill shriek that they hadn’t heard since she was a baby.",
    "Then it was silent. The whole family circled around to watch Aoife beat her small body with her own fists. Somewhere outside, a chaffinch chirped.",
    "The meltdown worried Siobhan. This was more than simple defiance. None of the other kids ever gave her so much trouble. Oisin, two years younger than Aoife, was already starting to help on the farm. None of them ever refused supper. And definitely none of them ever shrieked like that.",
    "This went beyond throwing a hissy fit to get what she wanted. There was something wrong with the child. Siobhan shuddered.",
    "The next Sunday, after mass, Siobhan sought out Caillea, the eldest woman of the village. Ringed in frizzled silver curls, the woman wore a black bombazine and had one eye blotted with icy white. Siobhan attempted to explain some of her concerns, seeking wisdom and guidance.",
    "“She’s stopped talkin’ at all. Mad as a box of frogs.”",
    "“Sounds like fairies,” Caillea said, “they steal children and replace ‘em with one of their own. Peculiar lot, plagued with megrims.”",
    "Siobhan thought back to when she first noticed Aoife’s eyes change color. The first time she’d heard that terrible scream—",
    "“She baptized?”",
    "“Of course, at six months.”",
    "“That usually prevents it. Must’ve already been too late.”",
    "—But that was so long ago. Could Aoife have been some other child this whole time? Siobhan wiped her clammy forehead. She searched her memories for another crux, but nothing stood out. Aoife was always utterly odd.",
    "“She’s your first, aye? New mothers are most at risk—the in-between leaves you vulnerable. Should have baptized her sooner.”",
    "“Ye don’t need to rabbit on about me blunders. Tell me how to fix it.”",
    "“Couple of different ways– confuse it, torture it. Get it to reveal itself and flee. Then they’ll return your baby.”",
    "Torture it.",
    "“How do I confuse her?”",
    "The next day, Aoife came home from playing, frock full of conkers and eggs, to find her mother doing the most unusual thing: sipping tea out the bottom half of an eggshell. Siobhan had a few more emptied shells on the counter. Seeing Aoife walk in the door, she offered one out to her.",
    "Aoife took the unreasonably tiny vessel. Siobhan filled the shell with a pinch of fragrant leaves. Aoife was indeed confused, though her face remained stony. Still, no words passed through her. She spun the egg around to try to identify the least spikey part to raise to her lips.",
    "“Ye enjoying yer tea?” Siobhan searched her daughter’s dead face for signs of change.",
    "Aoife slowly nodded. Perhaps this was her mother’s way of making a peace offering. An apology of sorts, though she couldn’t make sense of it. She tediously curled the corners of her mouth into a smile.",
    "“What’s all this then?” Siobhan sighed, gesturing to the lumpy skirt Aoife single-handedly held up like a basket. Of course, Siobhan thought, she could not do anything that would confuse this strange creature.",
    "Finally, the hint of an expression, as Aoife’s eyebrows wiggled with excitement. She dumped her treasures out and chestnuts rolled across the floor. Aoife beamed with pride. Siobhan watched the scattering mess—the eggshell cracked between her fingers, dripping a single drop of weak tea.",
    "“Clean it up,” she said through pursed lips, scooped all the eggshells off the table, and left to go add them to the chicken feed.",
    "Siobhan grew less and less patient with Aoife, snapping and yelling at her more frequently. Aoife fell deeper into her silence and solemnness. She no longer even whispered to Goldie, but spent much more time hugging her and stroking her feathers.",
    "Siobhan would add carrots and other ingredients to the pottage late in the day intentionally (even though it surely tasted worse). Did she do it simply to spite Aoife? If she kept pushing, perhaps Aoife would be forced to snap out of it and eat the hard carrots and act like a normal kid.",
    "Torture it.",
    "Caillea suggested all sorts of horrors. Beating it with a stick, drowning it. The fairy child wouldn’t tolerate the abuse, and would drop the act and run away.",
    "Siobhan just wanted her child back. She went with what she believed to be the least cruel option. Starving. It would be slower, give it a chance to give up at the pangs of hunger, before any real damage was done.",
    "Siobhan tried searching Aoife’s eyes to see if she was still in there, but Aoife wouldn’t look at her. Even when Siobhan grabbed Aoife by the sides of the face and forced eye contact, it still felt like Aoife was looking somewhere far off, looking straight through Siobhan, and it sent chills through her.",
    "Aoife thinned. Siobhan grew more definitive in her resolve, repeating to herself every day, every meal, that she was doing the right thing.",
    "Its body grew frailer. What it deserved. For stealing her sweet daughter away from her.",
    "Siobhan wasn’t even cruel, necessarily. All it had to do was leave and bring Aoife back. By choosing to stay, it was choosing to starve. It wouldn’t be able to put up with it much longer, Siobhan was certain.",
    "Except it did. It kept on living, growing bonier, with a swollen face and cracked lips, with a more sombre disposition. With movements like a somnambulist, the girl slowed, careful not to too harshly shake the eggs in her frock.",
    "Every night Siobhan was kept awake imagining what had happened to Aoife. Where was she taken? What were the Fae doing to her? Was she safe? Being hurt?",
    "The old woman had told her, “If tempting the changeling to reveal itself doesn’t work, then it needs to be forced out.”",
    "She decided her willingness to try more extreme measures. This thing had her child. She needed her back.",
    "Siobhan took Aoife to the elder’s home. A small beehive of stone stuck awkwardly out the side of a knoll. Soft brome sprouted high around it.",
    "“Caillea!” Siobahn called.",
    "The old woman pushed aside the sheet of heavy linen hung in the doorframe, no more than an inch, her fingers curling around the fabric. Her sole pigmented eye inspected the visitors, and she cocked a single brow.",
    "“It won’t go,” Siobhan’s gaze flickered toward the dying child.",
    "“You’ve finally decided?” Caillea didn’t pull the fabric back any further, but leaned forward to stick her nose out the gap. “Doesn’t usually take parents this long—but, they usually notice something’s wrong a lot sooner.”",
    "“Yer sure it’ll work?”",
    "“Rid you of the changeling at least. Flames’ll force it to dance up out the chimney,” her grey curls bobbed with her jittery twitches. “If your girl’s survived the other realm, she’ll be returned tonight.”",
    "Siobhan stopped clawing into the child’s shoulders and spun it around. Siobhan tried to catch the creature’s large, dark eyes, but couldn’t. They seemed to be looking somewhere far off, as usual. Aoife was truly gone.",
    "Aoife wondered why she and her mother were here, and what a changeling was. Questions bubbled up in her throat, but she still couldn’t get herself to speak. Imagining herself speaking, her mother’s angry reactions and yelling, made her flinch. She squinted and tried to shake the thoughts out of her head.",
    "“Nervous, are ya?” the old woman leaned in close to Aoife and grinned devilishly. The child winced at the sudden lack of personal space and the smell of rotting teeth.",
    "“Do I have to be here for you to do it?” Siobhan released her grip on Aoife.",
    "“No.” Caillea cupped Aoife’s chin and whispered, 'It’s time for you to go.'",
    "The two disappeared behind the linen. A gentle breeze whispered through the tall grasses and tousled the strands of mousy hair escaping Siobhan’s bonnet. She stood there for a long time before turning to leave, to return to Sean, to her three beautiful children. "
  ]
}
